📝 update puml to mermaid
