--- a/stories/SelectDataSet.md
+++ b/stories/SelectDataSet.md
@@ -1,15 +1,12 @@
 # Select dataset usecase
 
-```puml
-@startuml
-
-Actor User as U
-Participant System as S
-
-== Show Map ==
-
-U -> S : Select Dataset
-S -> U : Refresh map
-
-@enduml
+```mermaid
+sequenceDiagram
+    actor U as User
+    participant S as System
+    
+    note over U, S: Show Map
+    
+    U ->> S : Select Dataset
+    S ->> U : Refresh map
 ```
