--- a/stories/ShowDataNearUser.md
+++ b/stories/ShowDataNearUser.md
@@ -1,13 +1,11 @@
 # Show data near user usecase
-```puml
-@startuml
-actor User as U
-participant System as S
-
-=== Show Map ==
-
-U -> S : Click on show near data
-S -> U : zoom and pan on user location
-
-@enduml
+```mermaid
+sequenceDiagram
+    actor U as User
+    participant S as System
+    
+    note over U, S: Show Map    
+    
+    U ->> S : Click on show near data
+    S ->> U : zoom and pan on user location
 ```
