--- a/stories/ZoomPan.md
+++ b/stories/ZoomPan.md
@@ -1,15 +1,12 @@
 # Zoom or pan the map
 
-```puml
-@startuml
-
-Actor User as U
-Participant System as S
-
-== Show map ==
-
-U -> S : Ask for zooming or panning
-S -> U : Dynamically change the map
-
-@enduml
+```mermaid
+sequenceDiagram
+    actor U as User
+    participant S as System
+    
+    note over U, S: Show Map
+    
+    U ->> S : Ask for zooming or panning
+    S ->> U : Dynamically change the map
 ```
